# NewFBXExportOptions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewFBXExportOptions Method
Application Class See Also
---
Creates 3D-Studio Max (FBX) Export options.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FBXExportOptions NewFBXExportOptions()
```

Visual Basic
---
```text
Public Function NewFBXExportOptions As FBXExportOptions
```

Visual C++
---
```text
public:
FBXExportOptions^ NewFBXExportOptions()
```

# See Also
Application Class
Autodesk.Revit.Creation Namespace